Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_alb.default will be created
+ resource "aws_alb" "default" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "alb"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_alb.disabled will be created
+ resource "aws_alb" "disabled" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "alb"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb.default will be created
+ resource "aws_lb" "default" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "alb"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb.disabled will be created
+ resource "aws_lb" "disabled" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "alb"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # null_resource.example will be created
+ resource "null_resource" "example" {
      + id = (known after apply)
    }

  # module.vpc.aws_default_security_group.this[0] will be created
+ resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ssh"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "default"
        }
      + tags_all               = {
          + "Name" = "default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
+ resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "Ec2RoleShareRule1-us-east-1a"
        }
      + tags_all             = {
          + "Name" = "Ec2RoleShareRule1-us-east-1a"
        }
      + vpc                  = true
    }

  # module.vpc.aws_eip.nat[1] will be created
+ resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "Ec2RoleShareRule1-us-east-1b"
        }
      + tags_all             = {
          + "Name" = "Ec2RoleShareRule1-us-east-1b"
        }
      + vpc                  = true
    }

  # module.vpc.aws_eip.nat[2] will be created
+ resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "Ec2RoleShareRule1-us-east-1c"
        }
      + tags_all             = {
          + "Name" = "Ec2RoleShareRule1-us-east-1c"
        }
      + vpc                  = true
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
+ resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "Ec2RoleShareRule1"
        }
      + tags_all = {
          + "Name" = "Ec2RoleShareRule1"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
+ resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "Ec2RoleShareRule1-us-east-1a"
        }
      + tags_all             = {
          + "Name" = "Ec2RoleShareRule1-us-east-1a"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
+ resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "Ec2RoleShareRule1-us-east-1b"
        }
      + tags_all             = {
          + "Name" = "Ec2RoleShareRule1-us-east-1b"
        }
    }

  # module.vpc.aws_nat_gateway.this[2] will be created
+ resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "Ec2RoleShareRule1-us-east-1c"
        }
      + tags_all             = {
          + "Name" = "Ec2RoleShareRule1-us-east-1c"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
+ resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
+ resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[2] will be created
+ resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
+ resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
+ resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "Ec2RoleShareRule1-private-us-east-1a"
        }
      + tags_all         = {
          + "Name" = "Ec2RoleShareRule1-private-us-east-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
+ resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "Ec2RoleShareRule1-private-us-east-1b"
        }
      + tags_all         = {
          + "Name" = "Ec2RoleShareRule1-private-us-east-1b"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
+ resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "Ec2RoleShareRule1-private-us-east-1c"
        }
      + tags_all         = {
          + "Name" = "Ec2RoleShareRule1-private-us-east-1c"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
+ resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "Ec2RoleShareRule1-public"
        }
      + tags_all         = {
          + "Name" = "Ec2RoleShareRule1-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
+ resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "Ec2RoleShareRule1-private-us-east-1a"
        }
      + tags_all                        = {
          + "Name" = "Ec2RoleShareRule1-private-us-east-1a"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
+ resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "Ec2RoleShareRule1-private-us-east-1b"
        }
      + tags_all                        = {
          + "Name" = "Ec2RoleShareRule1-private-us-east-1b"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
+ resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "Ec2RoleShareRule1-private-us-east-1c"
        }
      + tags_all                        = {
          + "Name" = "Ec2RoleShareRule1-private-us-east-1c"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
+ resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.101.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "Ec2RoleShareRule1-public-us-east-1a"
        }
      + tags_all                        = {
          + "Name" = "Ec2RoleShareRule1-public-us-east-1a"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
+ resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.102.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "Ec2RoleShareRule1-public-us-east-1b"
        }
      + tags_all                        = {
          + "Name" = "Ec2RoleShareRule1-public-us-east-1b"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
+ resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.103.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "Ec2RoleShareRule1-public-us-east-1c"
        }
      + tags_all                        = {
          + "Name" = "Ec2RoleShareRule1-public-us-east-1c"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
+ resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = false
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "Ec2RoleShareRule1"
        }
      + tags_all                         = {
          + "Name" = "Ec2RoleShareRule1"
        }
    }

  # module.vpc.aws_vpn_gateway.this[0] will be created
+ resource "aws_vpn_gateway" "this" {
      + amazon_side_asn = "64512"
      + arn             = (known after apply)
      + id              = (known after apply)
      + tags            = {
          + "Name" = "Ec2RoleShareRule1"
        }
      + tags_all        = {
          + "Name" = "Ec2RoleShareRule1"
        }
      + vpc_id          = (known after apply)
    }

Plan: 35 to add, 0 to change, 0 to destroy.

The cloud account used in this analysis doesn't have a policy set, showing all FAILUREs and WARNINGs.
Preparing a filtered Terraform plan locally before uploading to Cloudrail Service...
Re-running your Terraform plan through a customized 'terraform plan' to generate needed context data...
Filtering and processing Terraform data...
Obfuscating IP addresses...
Submitting Terraform data to the Cloudrail Service...
Your job id is: 188b5bd6-fd5b-4d4a-91a0-627026179e89
Cloudrail Service accessing the latest cached snapshot of cloud account 866207001999. Timestamp: 2021-08-12 21:05:30Z...
Building simulated graph model, representing how the cloud account will look like if the plan were to be applied...
Running context-aware rules...
Running custom rules...
Returning results, almost done!
Assessment complete, fetching results...

WARNINGs found:
Rule: Ensure ELB has logging enabled
 - 2 Resources Exposed:
-----------------------------------------------
   - Exposed Resource: [aws_lb.disabled] (main.tf:43)
     Violating Resource: [aws_lb.disabled]  (main.tf:43)

     Evidence:
             | The Load Balancer aws_lb.disabled does not have logging enabled


   - Exposed Resource: [aws_lb.default] (main.tf:29)
     Violating Resource: [aws_lb.default]  (main.tf:29)

     Evidence:
             | The Load Balancer aws_lb.default does not have logging enabled


-----------------------------------------------
Rule: Ensure Load Balancer drops invalid HTTP headers
 - 2 Resources Exposed:
-----------------------------------------------
   - Exposed Resource: [aws_lb.default] (main.tf:29)
     Violating Resource: [aws_lb.default]  (main.tf:29)

     Evidence:
             | The Load Balancer aws_lb.default does not drop invalid HTTP headers


   - Exposed Resource: [aws_lb.disabled] (main.tf:43)
     Violating Resource: [aws_lb.disabled]  (main.tf:43)

     Evidence:
             | The Load Balancer aws_lb.disabled does not drop invalid HTTP headers


-----------------------------------------------
Rule: Ensure all resources that can be tagged have at least one tag
 - 20 Resources Exposed:
-----------------------------------------------
   - Exposed Resource: [module.vpc.aws_eip.nat[2]] (.terraform/modules/vpc/main.tf:1065)
     Violating Resource: [module.vpc.aws_eip.nat[2]]  (.terraform/modules/vpc/main.tf:1065)

     Evidence:
             | Resource Elastic IP address module.vpc.aws_eip.nat[2] does not have any tags set other than "Name"


   - Exposed Resource: [module.vpc.aws_vpc.this[0]] (.terraform/modules/vpc/main.tf:25)
     Violating Resource: [module.vpc.aws_vpc.this[0]]  (.terraform/modules/vpc/main.tf:25)

     Evidence:
             | Resource VPC module.vpc.aws_vpc.this[0] does not have any tags set other than "Name"


   - Exposed Resource: [module.vpc.aws_subnet.public[1]] (.terraform/modules/vpc/main.tf:371)
     Violating Resource: [module.vpc.aws_subnet.public[1]]  (.terraform/modules/vpc/main.tf:371)

     Evidence:
             | Resource Subnet module.vpc.aws_subnet.public[1] does not have any tags set other than "Name"


   - Exposed Resource: [module.vpc.aws_subnet.public[2]] (.terraform/modules/vpc/main.tf:371)
     Violating Resource: [module.vpc.aws_subnet.public[2]]  (.terraform/modules/vpc/main.tf:371)

     Evidence:
             | Resource Subnet module.vpc.aws_subnet.public[2] does not have any tags set other than "Name"


   - Exposed Resource: [module.vpc.aws_subnet.private[0]] (.terraform/modules/vpc/main.tf:400)
     Violating Resource: [module.vpc.aws_subnet.private[0]]  (.terraform/modules/vpc/main.tf:400)

     Evidence:
             | Resource Subnet module.vpc.aws_subnet.private[0] does not have any tags set other than "Name"


   - Exposed Resource: [module.vpc.aws_subnet.private[1]] (.terraform/modules/vpc/main.tf:400)
     Violating Resource: [module.vpc.aws_subnet.private[1]]  (.terraform/modules/vpc/main.tf:400)

     Evidence:
             | Resource Subnet module.vpc.aws_subnet.private[1] does not have any tags set other than "Name"


   - Exposed Resource: [module.vpc.aws_subnet.private[2]] (.terraform/modules/vpc/main.tf:400)
     Violating Resource: [module.vpc.aws_subnet.private[2]]  (.terraform/modules/vpc/main.tf:400)

     Evidence:
             | Resource Subnet module.vpc.aws_subnet.private[2] does not have any tags set other than "Name"


   - Exposed Resource: [module.vpc.aws_subnet.public[0]] (.terraform/modules/vpc/main.tf:371)
     Violating Resource: [module.vpc.aws_subnet.public[0]]  (.terraform/modules/vpc/main.tf:371)

     Evidence:
             | Resource Subnet module.vpc.aws_subnet.public[0] does not have any tags set other than "Name"


   - Exposed Resource: [aws_lb.default] (main.tf:29)
     Violating Resource: [aws_lb.default]  (main.tf:29)

     Evidence:
             | Resource Load Balancer aws_lb.default does not have any tags set


   - Exposed Resource: [aws_lb.disabled] (main.tf:43)
     Violating Resource: [aws_lb.disabled]  (main.tf:43)

     Evidence:
             | Resource Load Balancer aws_lb.disabled does not have any tags set


   - Exposed Resource: [module.vpc.aws_eip.nat[0]] (.terraform/modules/vpc/main.tf:1065)
     Violating Resource: [module.vpc.aws_eip.nat[0]]  (.terraform/modules/vpc/main.tf:1065)

     Evidence:
             | Resource Elastic IP address module.vpc.aws_eip.nat[0] does not have any tags set other than "Name"


   - Exposed Resource: [module.vpc.aws_eip.nat[1]] (.terraform/modules/vpc/main.tf:1065)
     Violating Resource: [module.vpc.aws_eip.nat[1]]  (.terraform/modules/vpc/main.tf:1065)

     Evidence:
             | Resource Elastic IP address module.vpc.aws_eip.nat[1] does not have any tags set other than "Name"


   - Exposed Resource: [module.vpc.aws_nat_gateway.this[2]] (.terraform/modules/vpc/main.tf:1083)
     Violating Resource: [module.vpc.aws_nat_gateway.this[2]]  (.terraform/modules/vpc/main.tf:1083)

     Evidence:
             | Resource NAT gateway module.vpc.aws_nat_gateway.this[2] does not have any tags set other than "Name"


   - Exposed Resource: [module.vpc.aws_nat_gateway.this[1]] (.terraform/modules/vpc/main.tf:1083)
     Violating Resource: [module.vpc.aws_nat_gateway.this[1]]  (.terraform/modules/vpc/main.tf:1083)

     Evidence:
             | Resource NAT gateway module.vpc.aws_nat_gateway.this[1] does not have any tags set other than "Name"


   - Exposed Resource: [module.vpc.aws_nat_gateway.this[0]] (.terraform/modules/vpc/main.tf:1083)
     Violating Resource: [module.vpc.aws_nat_gateway.this[0]]  (.terraform/modules/vpc/main.tf:1083)

     Evidence:
             | Resource NAT gateway module.vpc.aws_nat_gateway.this[0] does not have any tags set other than "Name"


   - Exposed Resource: [module.vpc.aws_route_table.private[1]] (.terraform/modules/vpc/main.tf:237)
     Violating Resource: [module.vpc.aws_route_table.private[1]]  (.terraform/modules/vpc/main.tf:237)

     Evidence:
             | Resource Route table module.vpc.aws_route_table.private[1] does not have any tags set other than "Name"


   - Exposed Resource: [module.vpc.aws_route_table.private[0]] (.terraform/modules/vpc/main.tf:237)
     Violating Resource: [module.vpc.aws_route_table.private[0]]  (.terraform/modules/vpc/main.tf:237)

     Evidence:
             | Resource Route table module.vpc.aws_route_table.private[0] does not have any tags set other than "Name"


   - Exposed Resource: [module.vpc.aws_route_table.public[0]] (.terraform/modules/vpc/main.tf:198)
     Violating Resource: [module.vpc.aws_route_table.public[0]]  (.terraform/modules/vpc/main.tf:198)

     Evidence:
             | Resource Route table module.vpc.aws_route_table.public[0] does not have any tags set other than "Name"


   - Exposed Resource: [module.vpc.aws_route_table.private[2]] (.terraform/modules/vpc/main.tf:237)
     Violating Resource: [module.vpc.aws_route_table.private[2]]  (.terraform/modules/vpc/main.tf:237)

     Evidence:
             | Resource Route table module.vpc.aws_route_table.private[2] does not have any tags set other than "Name"


   - Exposed Resource: [module.vpc.aws_default_security_group.this[0]] (.terraform/modules/vpc/main.tf:53)
     Violating Resource: [module.vpc.aws_default_security_group.this[0]]  (.terraform/modules/vpc/main.tf:53)

     Evidence:
             | Resource Security group module.vpc.aws_default_security_group.this[0] does not have any tags set other than "Name"


-----------------------------------------------
Rule: Ensure all security groups and rules have a description detailing the rule
 - 1 Resources Exposed:
-----------------------------------------------
   - Exposed Resource: [module.vpc.aws_default_security_group.this[0]] (.terraform/modules/vpc/main.tf:53)
     Violating Resource: [module.vpc.aws_default_security_group.this[0]]  (.terraform/modules/vpc/main.tf:53)

     Evidence:
             | The Security group module.vpc.aws_default_security_group.this[0] does not have a description for the ingress rule of 0.0.0.0/0 for ports 22:22 using protocol TCP


-----------------------------------------------
Rule: Ensure all used default security groups of every VPC restrict all traffic
 - 1 Resources Exposed:
-----------------------------------------------
   - Exposed Resource: [aws_lb.default] (main.tf:29)
     Violating Resource: [module.vpc.aws_default_security_group.this[0]]  (.terraform/modules/vpc/main.tf:53)

     Evidence:
         VPC module.vpc.aws_vpc.this[0]
             | aws_lb.default uses ENI eni-pseudo-5dc27222-0e23-4722-b278-63a8cf63c617
             | The ENI is secured by default Security group module.vpc.aws_default_security_group.this[0] and allows all traffic


-----------------------------------------------

Cloudrail ran this assessment without any policies and so all rule violations show as warnings.
You can increase a rule's enforcement level by creating a Policy in the Web UI and adding the rule to it.

Summary:
5 Rules Violated:
  0 Mandated Rules (these are considered FAILURES)
  5 Advisory Rules (these are considered WARNINGS)
0 Ignored Rules
110 Rules Skipped (no relevant resources found)
53 Rules Passed

To view this assessment in the Cloudrail Web UI, go to https://web.cloudrail.app/environments/assessments/188b5bd6-fd5b-4d4a-91a0-627026179e89

The cloud account used in this analysis doesn't have a policy set, showing all FAILUREs and WARNINGs.
Preparing a filtered Terraform plan locally before uploading to Cloudrail Service...
Re-running your Terraform plan through a customized 'terraform plan' to generate needed context data...
Filtering and processing Terraform data...
Obfuscating IP addresses...
Submitting Terraform data to the Cloudrail Service...
Your job id is: da4b4d15-6c19-4d2c-a09c-31948849e6d1
Cloudrail Service accessing the latest cached snapshot of cloud account 866207001999. Timestamp: 2021-08-12 21:05:30Z...
Building simulated graph model, representing how the cloud account will look like if the plan were to be applied...
Running context-aware rules...
Running custom rules...
Returning results, almost done!
Assessment complete, fetching results...
Saving results to: cloudrail.sarif
To view this assessment in the Cloudrail Web UI, go to https://web.cloudrail.app/environments/assessments/da4b4d15-6c19-4d2c-a09c-31948849e6d1

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0{
  "message": "You are not authorized to write security events.",
  "documentation_url": "https://docs.github.com/rest/reference/code-scanning#upload-a-sarif-file"
}
100  2923  100   167  100  2756    275   4550 --:--:-- --:--:-- --:--:--  4937

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://1bafb048d880:4141/lock?id=random930%252Fatlantis-example%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 35 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
